

import React from 'react';
import styles from './styles.module.css';


const steps = [
  { title: 'עמידה בחוקי המשחק', text: 'כל השחקנים מחויבים לפעול בהתאם לחוקי המשחק ולהוראות שניתנות במסגרת המשחק.',  },
  { title: 'אין ביצוע אירייפים', text: 'חל איסור מוחלט על ביצוע אירייפים (Ear Rape) בכל צורה שהיא.',  },
  { title: 'שינויי קול וסאונד', text: 'שימוש בשינוי קול או סאונד פד מותר רק כאשר הדבר מתאים לדמות במשחק. כל שימוש אחר אסור.',  },
  { title: 'כבוד לשחקנים ואנשי צוות', text: 'יש לדבר לכל שחקן או איש צוות בכבוד, תוך שמירה על נימוס והוגנות.',  },
  { title: 'הימנע מטרולים מוגזמים', text: 'חל איסור על ביצוע טרולים מעבר למידה סבירה. יש להימנע מפעולות שפוגעות בחוויית המשחק של אחרים.', },
  { title: 'אין פרסומים לא מורשים', text: 'אין לפרסם בכל רחבי הקהילה ללא אישור מפורש מאנשי הצוות.',  },
  { title: 'פרטיות והטרדה', text: 'חל איסור מוחלט על חדירה לפרטיות של משתמשים או אנשי צוות, או ביצוע כל פעולה אשר עשויה להטריד.',  },
  { title: 'שפות מותרות', text: 'השפות המותרות לשימוש בקהילה הן עברית ואנגלית בלבד.',  },
  { title: 'אין הספמת הצאט', text: 'חל איסור על הספמת הצאט. כתיבה של יותר מ-3 שורות ברצף תיחשב כהספמה.',  },
  { title: 'אין תוכן לא הולם', text: 'חל איסור על פרסום תוכן לא הולם או שימוש בשפה לא נאותה בפרטי עם אנשי צוות.',  },
  { title: 'חשבון משתמש אחיד', text: 'אין להיות מחובר לקהילה עם יותר מחשבון משתמש אחד בו זמנית.',  },
  { title: 'אין התחמקות מעונשים', text: 'כל ניסיון לעקוף עונש שניתן על ידי הצוות, בכל דרך שהיא, אסור בהחלט.', },
];

function Steps() {
  return (
    <div className={styles.stepsContainer}>
      {steps.map(({ title, text }) => (
        <div key={title} className={styles.stepCard}>
            <h6 className={styles.stepTitle}>{title}</h6>
          <p className={styles.stepText}>{text}</p>
        </div>
      ))}
    </div>
  );
}

export default Steps;